2_rails_with_active_record/module03/app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
    @number_of_completed_todos = TodoItem.count_of_completed_items
---
SELECT "todo_items".* FROM "todo_items"
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."completed" = ?  [["completed", "t"]]

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Random"], ["description", ""], ["due_date", "2016-02-01"], ["created_at", "2016-02-01 16:03:02.496936"], ["updated_at", "2016-02-01 16:03:02.496936"]]

  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", "f"], ["updated_at", "2016-02-01 15:53:04.433009"], ["id", 3]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 4]]